Wallet/src/Documents/ПереводМеждуСчетами/ПереводМеждуСчетами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереводМеждуСчетами</name>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>СчетСписания</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗачисления</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСписания</name>
    <type>
      <types>DefinedType.СуммаДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗачисления</name>
    <type>
      <types>DefinedType.СуммаДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>DefinedType.СуммаДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельПеревода</name>
    <type>
      <types>CatalogRef.ЦелиПереводов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Чек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Document>

Wallet/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияУчета</name>
    <type>
      <types>CatalogRef.КатегорииУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Wallet/src/InformationRegisters/КурсВнутреннихПереводов/КурсВнутреннихПереводов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсВнутреннихПереводов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>DefinedType.СуммаДокумента</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПереводМеждуСчетами</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВалютаИсточник</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаПриемник</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Wallet/src/Documents/ПереводМеждуСчетами/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    // Получаем переменные
    ТекущаяДата = ТекущаяДатаСеанса();
    ВалютаСписания = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СчетСписания, "Валюта");
    ВалютаЗачисления = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СчетЗачисления, "Валюта");
    
    // Очищаем старые движения
    Движения.ДенежныеСредства.Записывать = Истина;
    Движения.ДенежныеСредства.Очистить();
    
    // Списание с отправителя
    ДвижениеРасход = Движения.ДенежныеСредства.Добавить();
    ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
    ДвижениеРасход.Период = ТекущаяДата;
    ДвижениеРасход.Счет = СчетСписания;
    ДвижениеРасход.КатегорияУчета = Справочники.КатегорииУчета.ПереводМеждуСчетами;
    ДвижениеРасход.Валюта = ВалютаСписания;
    ДвижениеРасход.Сумма = СуммаСписания;
    
    // Поступление получателю
    ДвижениеПриход = Движения.ДенежныеСредства.Добавить();
    ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
    ДвижениеПриход.Период = ТекущаяДата;
    ДвижениеПриход.Счет = СчетЗачисления;
    ДвижениеПриход.КатегорияУчета = Справочники.КатегорииУчета.ПереводМеждуСчетами;
    ДвижениеПриход.Валюта = ВалютаЗачисления; 
    ДвижениеПриход.Сумма = СуммаЗачисления;
    
    // Записываем курс в историю
    Если ВалютаСписания <> ВалютаЗачисления Тогда
        Запись = РегистрыСведений.КурсВнутреннихПереводов.СоздатьМенеджерЗаписи();
        Запись.Период = ТекущаяДата;
        Запись.ВалютаИсточник = ВалютаСписания;
        Запись.ВалютаПриемник = ВалютаЗачисления;
        Запись.Курс = Курс;
        Запись.ДокументОснование = Ссылка;
        Запись.Записать();
    КонецЕсли;
    
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
